# Алгоритм
- набор инструкций для выполнения некоторой задачи

## Бинарный поиск
- это алгоритм поиска элемента в отсортированном массиве (или списке), который работает по принципу «разделяй и властвуй». Если элемент, который мы ищем, присутствует в списке, то бинарный поиск возвращает ту позицию, в которой он был найден. В противном случае - null.

### Как работает бинарный поиск:

Берём середину массива и сравниваем её значение с искомым элементом.
Если элемент найден — завершаем поиск.
Если искомое значение меньше середины — продолжаем поиск только в левой половине массива.
Если больше — только в правой половине.
Повторяем процесс, каждый раз сокращая количество проверяемых элементов вдвое.

## Время выполнения

- O(n) линейное (при простом поиске, кол-во попыток совпадает с размером списка);
- O(log n) логарифмическое (при бинарном поиске, логарифм - операция, обратная возведению в степень).

## "О - большое"
- специальная нотация, описывающая скорость работы алгоритма.

## Выводы:
- бинарный поиск работает быстрее простого;
- время выполнения O(log n) быстрее O(n), а с увеличением размера списка, оно становится намного быстрее;
- скорость алгоритмов НЕ измеряется в секундах;
- время выполнения алгоритма описывается ростом количества операций;
- время выполнения алгоритмов выражается как "О - большое".